//убрал из include библиотеку sdafx.h
#include <iostream>
#include <windows.h>
using namespace std;

int main() {
	int a, c, b;
	int* ca, * cb;
	int* sa, * sb, * sc;
	cout << "a = "; cin >> a; //ввёл 2
	cout << "b = "; cin >> b; // 2
	c = a + b; //4

	sb = &b;//инициализация указателей через взятие адреса
	sa = &a;
	sc = &c;
	//присваивание указателю значения выражения
	*sc = c + a - b;
	ca = sa;//присваивание указателю значения другого указателя
	cb = sb;
	*sa = 12;//присваивание указателю значения константы

	//верно, так как са = sa, а *sa = 12
	cout << "\n*ca = " << *ca;
	//верно *sa = 12
	cout << "\n*sa = " << *sa;
	//верно cb = sb, sb = &b, b = 2
	cout << "\n*cb = " << *cb;
	//верно  sb = &b, b = 2
	cout << "\n*sb = " << *sb;
	//верно  sc = &c, c = 4
	cout << "\n*sc = " << *sc;

	//такой же как а, тк ca = sa, sa = &a
	cout << "\nca = " << ca;
	//такой же как b, тк cb = sb, sb = &b
	cout << "\ncb = " << cb;
	//такой же как c, тк sc = &c
	cout << "\nsc = " << sc;

	//a = 12 - верно, так как a и sa указывают на одну и ту же память, а *sa = 12
	cout << "\na = " << a;
	//верно, не меняли
	cout << "\nb = " << b;
	//верно, не меняли
	cout << "\nc = " << c;
	
	cout << "\n&a = " << &a;
	cout << "\n&b = " << &b;
	cout << "\n&c = " << &c;
	cout << "\n*&a = " << *&a;

	//*сb = 12, *ca = 2, вывод -10 - верно
	cout << "\n*cb-*ca = " << *cb - *ca;
	//*сb = 12, *ca = 2, вывод 14 - верно
	cout << "\n*cb+*ca = " << *cb + *ca;

	*cb += 2; //сложение с константой
	//*cb = 4, указатель не изменился
	cout << "\ncb = " << cb;
	cout << "\ncb = " << *cb; // добавил строку для наглядности

	// увеличение на единицу будет означать увеличение адреса, который хранится в указателе, на размер типа указателя
	// в данном случае указатель int, его размер 4 байта
	// соответсвенно указатель увеличится на 4 в 16-ой системе счисления
	cb++; //инкремент
	cout << "\ncb = " << cb;

	// соответсвенно указатель уменьшится на 4 в 16-ой системе счисления
	cout << "\nca = " << ca; // для проверки изменения
	ca--; //декремент
	cout << "\nca = " << ca;
	cout << "\ncb-ca = " << cb - ca;
	system("pause");
	return 0;
}