# Лабораторная работа №7

## Задание: на языке C++ реализовать рекурсивный алгоритм “Ханойские башни”.

## Реализация: 

```c++
#include <iostream>
using namespace std;
void Hanoi(int n, int i, int k) {
    if (n == 1) cout << "move disk 1 from pin " << i << " to " << k <<endl;
    else {
        int tmp = 6 - i - k;
        Hanoi(n - 1, i, tmp);
        cout<< "move disk "<< n <<" from pin " << i << " to " << k <<endl;
        Hanoi(n - 1, tmp, k);
    }
 }
int main() {
    int num;
    cin >> num;
    cout <<endl;
    Hanoi(num, 1, 3);
    system("pause");
    return 0;
}
```

## Ответы на вопросы:

### 1. Что такое Ханойская башня?

Легенда гласит, что в Великом храме
города Бенарас, под собором, отмечающим середину мира, находится
бронзовый диск, на котором укреплены три алмазных стержня, высотой
в один локоть и толщиной с пчелу. Как только все 64 диска будут переложены со стержня, на кото-
рый Брахма сложил их при создании мира, на другой стержень, башня
вместе с храмом обратятся в пыль и под громовые раскаты погибнет
мир.

Ханойская башня является одной из популярных головоломок XIX века.

### 2. «Треугольное» решение

Расположим штыри в виде треугольника. Начнём с самого маленького кольца и переложим его на любую отметку. В дальнейшем это кольцо нужно перемещать в том же направлении, что и при первом перекладывании. Затем перенесём какое-нибудь из оставшихся колец (такой ход единственный), после чего снова переложим самое маленькое кольцо и т. д. (Интересно заметить, что перенумеровав «кольца» по порядку, мы добьёмся неожиданного эффекта: чётные кольца будут перемещаться из одной вершины треугольника в другую в одном направлении, а нечётные — в противоположном направлении.)

### 3. Рекурсивное решение

Рекурсивно решаем задачу «перенести башню из n−1 диска на 2-й штырь». Затем переносим самый большой диск на 3-й штырь, и рекурсивно решаем задачу «перенеси башню из n−1 диска на 3-й штырь».

Отсюда методом математической индукции заключаем, что минимальное число ходов, необходимое для решения головоломки, равно 2n − 1, где n — число дисков.

В информатике задачи, основанные на легенде о Ханойской башне, часто рассматривают в качестве примера использования рекурсивных алгоритмов и преобразования их к нерекурсивным.

### 4. Циклическое решение

Обозначим через «1-2» такое действие: переложить диск или с 1-го штыря на 2-й, или со 2-го на 1-й, в зависимости от того, где он меньше. Тогда, чтобы решить головоломку с чётным количеством дисков, надо многократно повторять действия: 1-2, 1-3, 2-3. Если число дисков нечётно — 1-3, 1-2, 2-3.

### 5. Применение кода Грея для решения

Код Грея, рефлексный двоичный код в двоичной системе счисления, в котором два соседних значения различаются только в одном двоичном разряде. Изначально код Грея предназначался для защиты от ложного срабатывания электромеханических переключателей. Сегодня коды Грея широко используются для упрощения выявления и исправления ошибок в системах связи, а также в формировании сигналов обратной связи в системах управления. Код получил имя исследователя лабораторий Bell Labs Фрэнка Грея. Он запатентовал (за номером 2632058) и использовал этот код в своей импульсной системе связи.

Коды Грея могут быть применены в решении задачи о Ханойских башнях.
Пусть N — количество дисков. Начнём с кода Грея длины N, состоящего из одних нулей (то есть G0), и будем двигаться по кодам Грея (от Gi переходить к Gi+1). Поставим в соответствие каждому i-ому биту текущего кода Грея i-ый диск (причём самому младшему биту соответствует наименьший по размеру диск, а самому старшему биту — наибольший). Поскольку на каждом шаге изменяется ровно один бит, то мы можем понимать изменение бита i как перемещение i-го диска. Заметим, что для всех дисков, кроме наименьшего, на каждом шаге имеется ровно один вариант хода (за исключением стартовой и финальной позиций). Для наименьшего диска всегда имеется два варианта хода, однако имеется стратегия правильного выбора хода: для нечётного N последовательность перемещений наименьшего диска f→t→r→f→t→r→… (где f — стартовый стержень, t — финальный стержень, r -оставшийся стержень), а для чётного f→r→t→f→r→t→….